ejenfransuavidok/tmfir/C8051F12x_FIR_Demo.c
//-----------------------------------------------------------------------------
// Includes
//-----------------------------------------------------------------------------

#include "si_toolchain.h"             // Compiler-specific declarations
                                       // (Keil/SDCC)
#include "C8051F120_defs.h"            // SFR declarations
#include <stdio.h>
#include <math.h>
#include "fir.h"
#include "modbus.h"

//-------------------------- BIPOLIAR SELECTOR --------------------------------
//#define BIPOLIAR_ADC
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// Global Constants
//-----------------------------------------------------------------------------

#define BAUDRATE     115200            // Baud rate of UART in bps

#define INTCLK       24500000          // Internal oscillator frequency in Hz    

#define SYSCLK       98000000          // Output of PLL derived from (INTCLK*2)

#define SAMPLE_RATE  11000             // Sample frequency in Hz

#define N            500               // Number of samples to capture at
                                       // each DAC frequency

#define PHASE_PRECISION  65536         // Range of phase accumulator

#define OUTPUT_RATE_DAC  20000L        // DAC output rate in Hz

#define START_FREQUENCY  10            // Define the starting frequency
#define STOP_FREQUENCY   4999          // Define the ending frequency
#define FREQ_STEP        10            // Define the number of Hz the frequency
                                       // will step for the frequency sweep
#define DAC1_VALUE       0x8000        // value for DAC1																			 
//-----------------------------------------------------------------------------
// Commands
//-----------------------------------------------------------------------------
const uint8_t CMD_1     =0x22;
const uint8_t CMD_2     =0x05;
const uint8_t CMD_3     =0x09;
const uint8_t CMD_4     =0x06;
const uint8_t CMD_5     =0x11;
const uint8_t CMD_6     =0x12;
//-----------------------------------------------------------------------------
// Macros
//-----------------------------------------------------------------------------

#if defined __C51__
#include <intrins.h>
#define NOP() \
   _nop_();
#elif defined SDCC
#define NOP() \
   _asm \
   nop \
   _endasm;
#endif // defined SDCC

// Single FIR_TAP macro takes advantage of mirroring
// (i.e. the FIR coefficients are mirrored, so the coefficient only needs to be
// loaded into the MAC registers once).
#define FIR_TAP_MIRROR(X,Y,Z) \
   MAC0A = X; \
   MAC0BH = Y.u8[MSB]; \
   MAC0BL = Y.u8[LSB]; \
   MAC0BH = Z.u8[MSB]; \
   MAC0BL = Z.u8[LSB];

// Single FIR_TAP macro
#define FIR_TAP(X,Y) \
   MAC0A = X; \
   MAC0BH = Y.u8[MSB]; \
   MAC0BL = Y.u8[LSB];

#define BREAK_MACRO \
   SFRPAGE = UART0_PAGE; \
	 if(TI0 == 1 || RI0 == 1){ \
	   break; \
	 } \
	 SFRPAGE = SFRPAGE_save;

//-----------------------------------------------------------------------------
// Global Variables
//-----------------------------------------------------------------------------
// For the FIR filter
// 'x' holds the 'delay line' of input samples
//idata SI_UU16_t x[TAPS];
SI_SEGMENT_VARIABLE(x[FILTER_MAX_ORDER], SI_UU16_t, xdata);
SI_SEGMENT_VARIABLE(B_FIR[FILTER_MAX_ORDER], SI_UU16_t, xdata);
SI_SEGMENT_VARIABLE(TAPS, uint8_t, xdata);
SI_SEGMENT_VARIABLE(data_for_filter[N], SI_UU16_t, xdata);
SI_SEGMENT_VARIABLE(data_for_filter_counter, int, xdata);
SI_SEGMENT_VARIABLE(filtered_samples[N], int, xdata);
SI_SEGMENT_VARIABLE(freq_number, unsigned char, xdata);
SI_SEGMENT_VARIABLE(phase_acc[12], SI_UU16_t, xdata) = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
SI_SEGMENT_VARIABLE(FREQS[12], unsigned long, xdata) = {1343, 1445, 1547, 1649, 1751, 1853, 1955, 2057, 2159, 2261, 2363, 2465};
SI_SEGMENT_VARIABLE(frequency, unsigned long, xdata);
SI_SEGMENT_VARIABLE(delay_index_arr[12], unsigned char, xdata) = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
SI_SEGMENT_VARIABLE(freq_divider, unsigned char, xdata);
SI_SEGMENT_VARIABLE(freq_dac_flags[12], unsigned char, xdata);

sbit LED = P1^6;                                     // LED='1' means ON
sbit LED485 = P7^7;                                  // LED for 485

SI_SEGMENT_VARIABLE(Sample, SI_UU16_t, xdata);       // Filter output
SI_SEGMENT_VARIABLE(Phase_Add[12], unsigned int, xdata); // For the frequency sweep
//-----------------------------------------------------------------------------
// Function Prototypes
//-----------------------------------------------------------------------------

void SYSCLK_Init (void);               // Configure system clock
void PORT_Init (void);                 // Configure port output
void UART0_Init (void);                // Configure UART operation
void Timer0_Init(void);								 // Configure Timer0
void ADC0_Init (void);                 // Configure ADC
void DAC0_Init(void);									 // Configure DAC0
void DAC1_Init(void);									 // Configure DAC1
void Timer3_Init (int counts);         // Configure Timer 3
void Timer4_Init (int counts);         // Configure Timer 4
void Set_DAC_Frequency (unsigned long frequency);
void init_after_flash_reload();
void bit_set(uint8_t d, uint8_t position);
void bit_clear(uint8_t d, uint8_t position);

// Define the UART printing functions
#if defined __C51__
char putchar (char c);                 // Define putchar for Keil
#elif defined SDCC
void putchar (char c);
#endif // defined SDCC

SI_INTERRUPT_PROTO(UART0_ISR, INTERRUPT_UART0);
SI_INTERRUPT_PROTO(TIMER0_ISR, INTERRUPT_TIMER0);
SI_INTERRUPT_PROTO(ADC0_ISR, INTERRUPT_ADC0_EOC);
// A full cycle, 16-bit, 2's complement sine wave lookup table
//int code SINE_TABLE[256] = {
SI_SEGMENT_VARIABLE(SINE_TABLE[256], int, code) = {
   0x0000, 0x0324, 0x0647, 0x096a, 0x0c8b, 0x0fab, 0x12c8, 0x15e2,
   0x18f8, 0x1c0b, 0x1f19, 0x2223, 0x2528, 0x2826, 0x2b1f, 0x2e11,
   0x30fb, 0x33de, 0x36ba, 0x398c, 0x3c56, 0x3f17, 0x41ce, 0x447a,
   0x471c, 0x49b4, 0x4c3f, 0x4ebf, 0x5133, 0x539b, 0x55f5, 0x5842,
   0x5a82, 0x5cb4, 0x5ed7, 0x60ec, 0x62f2, 0x64e8, 0x66cf, 0x68a6,
   0x6a6d, 0x6c24, 0x6dca, 0x6f5f, 0x70e2, 0x7255, 0x73b5, 0x7504,
   0x7641, 0x776c, 0x7884, 0x798a, 0x7a7d, 0x7b5d, 0x7c29, 0x7ce3,
   0x7d8a, 0x7e1d, 0x7e9d, 0x7f09, 0x7f62, 0x7fa7, 0x7fd8, 0x7ff6,
   0x7fff, 0x7ff6, 0x7fd8, 0x7fa7, 0x7f62, 0x7f09, 0x7e9d, 0x7e1d,
   0x7d8a, 0x7ce3, 0x7c29, 0x7b5d, 0x7a7d, 0x798a, 0x7884, 0x776c,
   0x7641, 0x7504, 0x73b5, 0x7255, 0x70e2, 0x6f5f, 0x6dca, 0x6c24,
   0x6a6d, 0x68a6, 0x66cf, 0x64e8, 0x62f2, 0x60ec, 0x5ed7, 0x5cb4,
   0x5a82, 0x5842, 0x55f5, 0x539b, 0x5133, 0x4ebf, 0x4c3f, 0x49b4,
   0x471c, 0x447a, 0x41ce, 0x3f17, 0x3c56, 0x398c, 0x36ba, 0x33de,
   0x30fb, 0x2e11, 0x2b1f, 0x2826, 0x2528, 0x2223, 0x1f19, 0x1c0b,
   0x18f8, 0x15e2, 0x12c8, 0x0fab, 0x0c8b, 0x096a, 0x0647, 0x0324,
   0x0000, 0xfcdc, 0xf9b9, 0xf696, 0xf375, 0xf055, 0xed38, 0xea1e,
   0xe708, 0xe3f5, 0xe0e7, 0xdddd, 0xdad8, 0xd7da, 0xd4e1, 0xd1ef,
   0xcf05, 0xcc22, 0xc946, 0xc674, 0xc3aa, 0xc0e9, 0xbe32, 0xbb86,
   0xb8e4, 0xb64c, 0xb3c1, 0xb141, 0xaecd, 0xac65, 0xaa0b, 0xa7be,
   0xa57e, 0xa34c, 0xa129, 0x9f14, 0x9d0e, 0x9b18, 0x9931, 0x975a,
   0x9593, 0x93dc, 0x9236, 0x90a1, 0x8f1e, 0x8dab, 0x8c4b, 0x8afc,
   0x89bf, 0x8894, 0x877c, 0x8676, 0x8583, 0x84a3, 0x83d7, 0x831d,
   0x8276, 0x81e3, 0x8163, 0x80f7, 0x809e, 0x8059, 0x8028, 0x800a,
   0x8000, 0x800a, 0x8028, 0x8059, 0x809e, 0x80f7, 0x8163, 0x81e3,
   0x8276, 0x831d, 0x83d7, 0x84a3, 0x8583, 0x8676, 0x877c, 0x8894,
   0x89bf, 0x8afc, 0x8c4b, 0x8dab, 0x8f1e, 0x90a1, 0x9236, 0x93dc,
   0x9593, 0x975a, 0x9931, 0x9b18, 0x9d0e, 0x9f14, 0xa129, 0xa34c,
   0xa57e, 0xa7be, 0xaa0b, 0xac65, 0xaecd, 0xb141, 0xb3c1, 0xb64c,
   0xb8e4, 0xbb86, 0xbe32, 0xc0e9, 0xc3aa, 0xc674, 0xc946, 0xcc22,
   0xcf05, 0xd1ef, 0xd4e1, 0xd7da, 0xdad8, 0xdddd, 0xe0e7, 0xe3f5,
   0xe708, 0xea1e, 0xed38, 0xf055, 0xf375, 0xf696, 0xf9b9, 0xfcdc,
};

// Similar to STARTUP.A51 for Keil, this function stub for SDCC allows us to
// disable the WDT before memory is initialized.
#if defined SDCC
void _sdcc_external_startup (void);

void _sdcc_external_startup (void)
{
   WDTCN = 0xDE;                       // Disable watchdog timer
   WDTCN = 0xAD;
}
#endif // defined SDCC

