ejenfransuavidok/tmfir/C8051F12x_FIR_Demo.c
//-----------------------------------------------------------------------------
// MAIN Routine
//-----------------------------------------------------------------------------

void main (void)
{
	 //-----------------------------------------------------------------------------
	 // FIR VARIABLES
	 //-----------------------------------------------------------------------------
   static unsigned char delay_index = 0;
	 SI_SEGMENT_VARIABLE(coeff_index, unsigned char, xdata);
	 SI_SEGMENT_VARIABLE(sample_index, unsigned char, xdata);
	 SI_SEGMENT_VARIABLE(opposite_sample_index, unsigned char, xdata);
	 SI_SEGMENT_VARIABLE(i, int, xdata);
	 unsigned int RMS_Value = 0; 
	//-----------------------------------------------------------------------------
	 void (*init_func_pointer)(void) = init_after_flash_reload;
	 //-----------------------------------------------------------------------------
	 
   WDTCN = 0xDE;                       // Disable watchdog timer
   WDTCN = 0xAD;

   SYSCLK_Init ();                     // Initialize oscillator
   PORT_Init ();                       // Initialize crossbar and GPIO
   UART0_Init ();                      // Initialize UART0
	 Timer0_Init ();
	
	 // Initialize Timer3 to overflow at the ADC sample rate
   Timer3_Init (SYSCLK/SAMPLE_RATE);
	
	 // Initialize Timer4 to overflow at the DAC sample rate
   Timer4_Init (SYSCLK/OUTPUT_RATE_DAC);	
	
	 DAC0_Init ();                       // Initialize the DAC0
	 DAC1_Init ();                       // Initialize the DAC1
	 ADC0_Init ();                       // Initialize the ADC	
	
   SFRPAGE = ADC0_PAGE;

   AD0EN = 1;                          // Enable ADC

   SFRPAGE = MAC0_PAGE;

   MAC0CF = 0x06;                      // Fractional mode; Saturate
                                       // enabled
	 data_for_filter_counter = 0;
	 
	 //
	 freq_number = 0;
	 
	 frequency = START_FREQUENCY;
	 
	 EA = 1;
	
	 modbus_init_from_flash(init_func_pointer);
	 
//-----------------------------------------------------------------------------	 
   while (1) {
      if (data_for_filter_counter == N) {
			   for (freq_number=0; freq_number<12; freq_number++) {
            delay_index = delay_index_arr [freq_number];
					  // Initialize the delay line for the FIR filter
					  for (i = 0; i < FILTER_MAX_ORDER; i++)
					  {
						   x[i].s16 = 0;
					  }
					  // Initialize the sample array
					  for (i = 0; i < N; i ++)
					  {
						   filtered_samples[i] = 0;
					  }
            //EA = 0;						
					  TAPS = populateFirCoefficients(B_FIR, freq_number);
					  //EA = 1;
						if (TAPS != 61) {
						   NOP();
						}
						if (TAPS == 61) {
							for (i=0; i<N; i++) {					
								 // Store ADC result in the delay line
								 x[delay_index].u16 = data_for_filter[i].u16;
								 // Sample_index points to newest data
								 sample_index = delay_index;         
								 // Update delay index
								 if (delay_index == (TAPS - 1))
								 {
										delay_index = 0;
								 }
								 else
								 {
										delay_index++;
								 }

								 MAC0CF |= 0x08;                  // Clear accumulator
						
								 // Mirror algorithm
								 if (sample_index == TAPS - 1)
								 {
										opposite_sample_index = 0;
								 }
								 else
								 {
										opposite_sample_index = sample_index + 1;
								 }
								 for (coeff_index = 0; coeff_index < (TAPS / 2); coeff_index++)
								 {
										FIR_TAP_MIRROR (B_FIR[coeff_index].u16, x[sample_index],
										x[opposite_sample_index]);
									 
										if (sample_index == 0)
										{
											 sample_index = TAPS - 1;
										}
										else
										{
											 sample_index--;
										}

										if (opposite_sample_index == TAPS - 1)
										{
											 opposite_sample_index = 0;
										}
										else
										{
											 opposite_sample_index++;
										}
								 }
								 if ((TAPS % 2) == 1)             // Handle middle tap of odd order filter
								 {
										FIR_TAP (B_FIR[coeff_index].u16, x[sample_index]);
										NOP ();
										NOP ();
										NOP ();
								 }
								 Sample.u16 = MAC0RND;
								 filtered_samples[i] = Sample.u16;
							}
							RMS_Value = RMS_Calc(filtered_samples, N, TAPS);
							putRms2Modbus(RMS_Value, freq_number);
							delay_index_arr [freq_number] = delay_index;
						}
				 }
			   LED = !LED;
			   data_for_filter_counter = 0;
			}
   }
//-----------------------------------------------------------------------------	 
}

//-----------------------------------------------------------------------------
// Initialization Subroutines
//-----------------------------------------------------------------------------

//-----------------------------------------------------------------------------
// SYSCLK_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// This routine initializes the system clock to use the internal 24.5MHz*4
// oscillator as its clock source.
//
//-----------------------------------------------------------------------------
void SYSCLK_Init (void)
{
   SI_SEGMENT_VARIABLE(i, char, xdata);
	
   SI_SEGMENT_VARIABLE(SFRPAGE_SAVE, char, xdata);
	
	 SFRPAGE_SAVE = SFRPAGE;             // Save Current SFR page

   SFRPAGE = CONFIG_PAGE;              // Switch to the necessary SFRPAGE

   OSCICN = 0x83;

   // Step 2. Set the PLLSRC bit (PLL0CN.2) to select the desired
   // clock source for the PLL.
   PLL0CN &= ~0x04;                    // Internal oscillator

   // Step 3. Program the Flash read timing bits, FLRT (FLSCL.5-4) to the
   // appropriate value for the new clock rate (see Section 15. Flash Memory
   // on page 199).
   SFRPAGE = LEGACY_PAGE;
   FLSCL |= 0x30;                      // >= 100 MHz
   SFRPAGE = CONFIG_PAGE;

   // Step 4. Enable power to the PLL by setting PLLPWR (PLL0CN.0) to ‘1’.
   PLL0CN |= 0x01;

   // Step 5. Program the PLL0DIV register to produce the divided reference
   // frequency to the PLL.
   PLL0DIV = 0x01;

   // Step 6. Program the PLLLP3-0 bits (PLL0FLT.3-0) to the appropriate
   // range for the divided reference frequency.
   PLL0FLT |= 0x01;

   // Step 7. Program the PLLICO1-0 bits (PLL0FLT.5-4) to the appropriate
   // range for the PLL output frequency.
   PLL0FLT &= ~0x30;

