ejenfransuavidok/tmfir/C8051F12x_FIR_Demo.c
   // Step 8. Program the PLL0MUL register to the desired clock multiplication
   // factor.
   PLL0MUL = 0x04;

   // Step 9. Wait at least 5 µs, to provide a fast frequency lock.
   for (i = 100; i > 0; i--);

   // Step 10. Enable the PLL by setting PLLEN (PLL0CN.1) to ‘1’.
   PLL0CN |= 0x02;

   // Step 11. Poll PLLLCK (PLL0CN.4) until it changes from ‘0’ to ‘1’.
   while ((PLL0CN & 0x10) != 0x10);

   // Step 12. Switch the System Clock source to the PLL using the CLKSEL
   // register.
   CLKSEL = 0x02;

   SFRPAGE = SFRPAGE_SAVE;             // Restore the SFRPAGE
}

//-----------------------------------------------------------------------------
// PORT_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// Configure the Crossbar and GPIO ports.
//
// Pinout:
//
// P0.0 - UART TX1 (push-pull)
// P0.1 - UART RX1
//
// P1.6 - LED (push-pull)
//
// DAC0 - DAC0 output
//
// AIN0.0 - ADC0 analog input
//
// Note: DAC0 and AIN0.0 must be tied together.
//
//-----------------------------------------------------------------------------
void PORT_Init (void)
{
   SI_SEGMENT_VARIABLE(SFRPAGE_save, unsigned char, xdata);
	 SFRPAGE_save = SFRPAGE;             // Save the current SFRPAGE

   SFRPAGE = CONFIG_PAGE;              // Switch to the necessary SFRPAGE

   XBR0     = 0x04;
   XBR1     = 0x00;
   XBR2     = 0x40;                    // Enable crossbar and weak pull-up
                                       // Enable UART0

   P0MDOUT |= 0x01;                    // Set TX1 pin to push-pull
   P1MDOUT |= 0x40;                    // Set P1.6(LED) to push-pull
	 P5MDOUT |= 0xFF;
	 P6MDOUT |= 0xFF;
	 P7MDOUT |= 0xFF;
	
   SFRPAGE = SFRPAGE_save;             // Restore the SFRPAGE
}

//-----------------------------------------------------------------------------
// UART0_Init
//-----------------------------------------------------------------------------
void Timer0_Init(void)
{
	SI_SEGMENT_VARIABLE(SFRPAGE_save, unsigned char, xdata);
	SFRPAGE_save = SFRPAGE;
	
	SFRPAGE = TIMER01_PAGE;
	
	TMOD   &= 0xFD;
	TMOD	 |= 0x01;
	TH0			= 0x00;
  TL0			= 0x00;
	ET0			= 1;
	TR0			= 1;
	CKCON  |= 0x08;
	SFRPAGE = SFRPAGE_save;
}
//-----------------------------------------------------------------------------
// UART0_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// Configure the UART0 using Timer1, for <BAUDRATE> and 8-N-1.
//
//-----------------------------------------------------------------------------
void UART0_Init (void)
{
   SI_SEGMENT_VARIABLE(SFRPAGE_save, unsigned char, xdata); 
	 SFRPAGE_save = SFRPAGE; // Save the current SFRPAGE

   SFRPAGE = UART0_PAGE;               // Switch to the necessary SFRPAGE
	 	
   SCON0  = 0x70;
	 TMOD   = 0x20;
	 TH1    = 0x5D;///0xE5;///0x5D;////0xE5;// - 115200;
	 TR1    = 1;
	 CKCON |= 0x10;
	 PCON  |= 0x80;//SMOD0 = 1 
	
   TI0    = 0;                         // Indicate TX0 ready
	 
	 PS0    = 1;
	
	 ES0    = 1; 
	
   SFRPAGE = SFRPAGE_save;             // Restore the SFRPAGE
}
//-----------------------------------------------------------------------------
// DAC0_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// Configure DAC1 to update on Timer4 overflows.  VREF is already enabled by
// the ADC initialization code.
//
//-----------------------------------------------------------------------------
void DAC0_Init(void){

   SI_SEGMENT_VARIABLE(SFRPAGE_SAVE, char, xdata);
	 SFRPAGE_SAVE = SFRPAGE;             // Save Current SFR page

   SFRPAGE = DAC0_PAGE;

   DAC0CN = 0x94;                      // Enable DAC0 in left-justified mode
                                       // managed by Timer4 overflows

   SFRPAGE = SFRPAGE_SAVE;             // Restore SFR page
}

//-----------------------------------------------------------------------------
// DAC1_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// Configure DAC1 to update on write to DAC1H.  VREF is already enabled by
// the ADC initialization code.
//
//-----------------------------------------------------------------------------
void DAC1_Init(void){

   SI_SEGMENT_VARIABLE(SFRPAGE_SAVE, char, xdata);
	 SFRPAGE_SAVE = SFRPAGE;             // Save Current SFR page

   SFRPAGE = DAC1_PAGE;

   DAC1CN = 0x84;                      // Enable DAC1 in left-justified mode
                                       // managed by write data to DAC1H
	 
	 DAC1 = DAC1_VALUE;                  // Write to DAC1

   SFRPAGE = SFRPAGE_SAVE;             // Restore SFR page
}

//-----------------------------------------------------------------------------
// ADC0_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// Configures ADC0 to make single-ended analog measurements on pin AIN0.0 for
// the FIR filter.  Timer3 overflows are the conversion source and the data is
// left-justified.  This function also enables the ADC end-of-conversion
// interrupt and leaves the ADC disabled.
//
//-----------------------------------------------------------------------------
void ADC0_Init (void)
{
   SI_SEGMENT_VARIABLE(SFRPAGE_SAVE, char, xdata);
	
	 SFRPAGE_SAVE = SFRPAGE;             // Save Current SFR page

   SFRPAGE = ADC0_PAGE;

   ADC0CN = 0x05;                      // ADC0 disabled; normal tracking
                                       // mode; ADC0 conversions are initiated
                                       // on overflow of Timer3; ADC0 data is
                                       // left-justified

   REF0CN = 0x03;                      // Enable on-chip VREF and VREF output
                                       // buffer
#ifndef BIPOLIAR_ADC
   AMX0SL = 0x00;                      // Select AIN0.0 as ADC mux input
#else	
	 AMX0CF = 0x01;
	 AMX0SL = 0x00;
#endif
	
   ADC0CF = (SYSCLK/2500000) << 3;     // ADC conversion clock = 2.5MHz

   EIE2 |= 0x02;                       // Enable ADC interrupts

