ejenfransuavidok/tmfir/C8051F12x_FIR_Demo.c
   SFRPAGE = SFRPAGE_SAVE;             // Restore SFR page
}

//-----------------------------------------------------------------------------
// Timer3_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:    None
//
// Configure Timer3 to auto-reload at interval specified by <counts> (no
// interrupt generated) using SYSCLK as its time base.
//
// Timer 3 overflow automatically triggers ADC0 conversion.
//
//-----------------------------------------------------------------------------
void Timer3_Init (int counts)
{
   SI_SEGMENT_VARIABLE(SFRPAGE_SAVE, char, xdata);
	
	 SFRPAGE_SAVE = SFRPAGE;             // Save Current SFR page

   SFRPAGE = TMR3_PAGE;

   TMR3CN = 0x00;                      // Stop Timer3; Clear TF3;
   TMR3CF = 0x08;                      // use SYSCLK as timebase

   RCAP3   = -counts;                  // Init reload values
   TMR3    = RCAP3;                    // set to reload immediately
   EIE2   &= ~0x01;                    // Disable Timer3 interrupts
   TR3 = 1;                            // Start Timer3

   SFRPAGE = SFRPAGE_SAVE;             // Restore SFR page
}
//-----------------------------------------------------------------------------
// Timer4_Init
//-----------------------------------------------------------------------------
//
// Return Value:  None
// Parameters:
//   1) counts - the number of timer clocks to count before a timer interrupt
//           should occur
//
// Configure Timer4 to auto-reload mode and to generate interrupts
// at intervals specified in <counts> using SYSCLK as its time base.
//
// Timer 4 overflow controls the DAC update rate.
//
//-----------------------------------------------------------------------------
void Timer4_Init (int counts)
{
   SI_SEGMENT_VARIABLE(SFRPAGE_SAVE, char, xdata);
	
	 SFRPAGE_SAVE = SFRPAGE;          // Save Current SFR page

   SFRPAGE = TMR4_PAGE;

   TMR4CN = 0x00;                   // Stop Timer4; Clear overflow flag (TF4);
                                    // Set to Auto-Reload Mode

   TMR4CF = 0x08;                   // Configure Timer4 to increment;
                                    // Timer4 counts SYSCLKs

   RCAP4 = -counts;                 // Set reload value
   TMR4 = RCAP4;                    // Initialzie Timer4 to reload value
	
   EIE2 |= 0x04;                    // Enable Timer4 interrupts
   TR4 = 1;                         // Start Timer4

   SFRPAGE = SFRPAGE_SAVE;          // Restore SFR page
}
//-----------------------------------------------------------------------------
// ADC0_ISR
//-----------------------------------------------------------------------------
//
// ADC0 end-of-conversion ISR
//
// This interrupt service routine is called on ADC0 conversion complete.
// The ADC result is converted to signed and stored in the FIR delay line.
//
// If the global <FIR_On> bit is set to a '1', then the FIR output is computed
// and stored in the global variable 'Sample'.  The 'Sample_Ready' indicator
// bit is set to indicate the value is ready.
//
// If <FIR_On> is set to '0', then the ADC sample is copied to the global
// 'Sample' variable.  The 'Sample_Ready' indicator bit is set to indicate
// that the value is ready.
//
//-----------------------------------------------------------------------------
//void ADC0_ISR (void) interrupt 15
#pragma NOAREGS
SI_INTERRUPT(ADC0_ISR, INTERRUPT_ADC0_EOC)
{
	 volatile SI_UU16_t input;
	
   AD0INT = 0;                         // Clear ADC conversion complete
                                       // indicator

   input.s16 = ADC0^0x8000;            // Convert to bipolar value
	 
	 
   if (data_for_filter_counter < N) {
			data_for_filter [data_for_filter_counter++].u16 = input.u16;
	 }
}

#pragma NOAREGS
SI_INTERRUPT(TIMER0_ISR, INTERRUPT_TIMER0)
{
	unsigned char SFRPAGE_save = SFRPAGE;
	SFRPAGE = TIMER01_PAGE;
	TH0			= 0x00;
  TL0			= 0x00;
	TF0 		= 0;
	SFRPAGE = SFRPAGE_save;
	if(modbus_was_sendind_received()) {
		modbus_command_received();
		LED485 	= !LED485;
	}
	SFRPAGE = SFRPAGE_save;
}

#pragma NOAREGS
SI_INTERRUPT(UART0_ISR, INTERRUPT_UART0)
{
	unsigned char SFRPAGE_save = SFRPAGE; // Save the current SFRPAGE
  SFRPAGE = UART0_PAGE;
	if(RI0 == 1) {
		modbus_byte_receive(SBUF0);
		RI0 = 0;
	}
	if(TI0 == 1) {
		TI0 = 0;
		if (modbus_transmit_buffer_is_empty()) {
		}
		else {
			modbus_transmit_byte();
		}
	}
	SFRPAGE = SFRPAGE_save;               // Restore the SFRPAGE	
}
//-----------------------------------------------------------------------------
// Timer4_ISR
//-----------------------------------------------------------------------------
//
// This ISR is called on Timer4 overflows.  Timer4 is set to auto-reload mode
// and is used to schedule the DAC output sample rate in this example.
// Note that the value that is written to DAC1 during this ISR call is
// actually transferred to DAC1 at the next Timer4 overflow.
//
//-----------------------------------------------------------------------------
//void Timer4_ISR (void) interrupt 16
#pragma NOAREGS
SI_INTERRUPT(Timer4_ISR, INTERRUPT_TIMER4)
{ 
	 char number = 0;
	 int temp1 = 0;											 // The temporary value that passes
                                       // through 3 stages before being written
                                       // to the IDAC
   TMR3CN &= ~0x80;                    // Clear Timer3 overflow flag
	
   for (number=0; number<12; number++) {
			if (freq_dac_flags [number] == 1) {
				phase_acc[number].u16 += Phase_Add [number];
				temp1 += (SINE_TABLE[phase_acc[number].u8[MSB]] / freq_divider);
	 		}
	 }
		 
   SFRPAGE = DAC0_PAGE;

   // Add a DC bias to make the rails 0 to 65535
   // Note: the XOR with 0x8000 translates the bipolar quantity into
   // a unipolar quantity.

   DAC0 = 0x8000 ^ temp1;              // Write to DAC0
}

#pragma NOAREGS
void init_after_flash_reload() {
	 //-----------------------------------------------------------------------
	 SI_SEGMENT_VARIABLE(i, uint8_t, xdata);
	 //----------------------- FREQ DIVIDER INIT -----------------------------
   freq_divider = modbus_get_freq_divider();
	 if (freq_divider == 0) {
      freq_divider = 1;
   }
   //--------------------------- FREQ INIT ---------------------------------
   modbus_init_freqs(FREQS);
   //-----------------------------------------------------------------------
	 // CLEAR - INVERSE LOGIC
	 P5 =  0xFF;
	 P6 |= 0xF0;
	 P7 =  0xFF;
	 for (i=0; i<12; i++) {
	    Phase_Add [i] = (unsigned int)((unsigned long)((FREQS [i] *
                PHASE_PRECISION) / OUTPUT_RATE_DAC));
	    if (getFreqFromModbusForDAC(i) != 0) {
				 freq_dac_flags [i] = 1;
			} else {
			   freq_dac_flags [i] = 0;
			}
			if (i < 8) {
				 // INVERSE LOGIG
				 freq_dac_flags [i] == 1 ? bit_clear(P5, i) : bit_set(P5, i);
			} else {
				 // INVERSE LOGIG
				 freq_dac_flags [i] == 1 ? bit_clear(P6, i - 4) : bit_set(P6, i - 4);
			}
	 }
	 if (P5 & (uint8_t)CMD_1 == (uint8_t)CMD_1) {
	    bit_clear(P7, 0);
	 }
	 if (P5 & CMD_2 == CMD_2) {
		  bit_clear(P7, 1);
	 }
	 if (P5 & CMD_3 == CMD_3) {
			bit_clear(P7, 2);
	 }
	 if (P5 & CMD_4 == CMD_4) {
			bit_clear(P7, 3);
	 }
	 if (P5 & CMD_5 == CMD_5) {
			bit_clear(P7, 4);
	 }
	 if (P5 & CMD_6 == CMD_5) {
	    bit_clear(P7, 5);
	 }
	 //-----------------------------------------------------------------------
}
//-----------------------------------------------------------------------------
// bits operations
//-----------------------------------------------------------------------------

void bit_set(uint8_t d, uint8_t position)
{
    d |= (1u<<position);
}
void bit_clear(uint8_t d, uint8_t position)
{
    d &= ~(1u<<position);
}
//-----------------------------------------------------------------------------
// putchar
//-----------------------------------------------------------------------------
//
// Return Value:
//   1) char c - returns the char c that was passed as a parameter
// Parameters:
//   1) char c - the character to be printed
//
// Print the character <c> using UART0 at <BAUDRATE>.
//
//-----------------------------------------------------------------------------
#if defined __C51__
char putchar (char c)
#elif defined SDCC
void putchar (char c)
#endif
{
	 modbus_push_transmit_buffer(c);
#if defined __C51__
   return c;                           // Print the character
#endif
}
//-----------------------------------------------------------------------------
// End Of File
//-----------------------------------------------------------------------------
